#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.duc-bac-nginx-service will be created
  + resource "google_cloud_run_service" "duc-bac-nginx-service" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "asia-southeast1"
      + name                       = "duc-bac-nginx-service"
      + project                    = "infrateam-playground"
      + status                     = (known after apply)

      + metadata (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"        = "10"
                  + "autoscaling.knative.dev/minScale"        = "0"
                  + "run.googleapis.com/vpc-access-connector" = "duc-bac-vpc-connector"
                  + "run.googleapis.com/vpc-access-egress"    = "all-traffic"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 20
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "nginx:latest"
                  + name  = "duc-bac-nginx-service"

                  + ports {
                      + container_port = 80
                      + name           = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }

                  + startup_probe (known after apply)
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_member.duc-bac-nginx-service-invoker will be created
  + resource "google_cloud_run_service_iam_member" "duc-bac-nginx-service-invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-southeast1"
      + member   = "allUsers"
      + project  = "infrateam-playground"
      + role     = "roles/run.invoker"
      + service  = "duc-bac-nginx-service"
    }

  # google_cloud_scheduler_job.jobs["duc-bac-nginx-job"] will be created
  + resource "google_cloud_scheduler_job" "jobs" {
      + attempt_deadline = "320s"
      + description      = "Job to trigger the Nginx Cloud Run service"
      + id               = (known after apply)
      + name             = "duc-bac-nginx-job"
      + paused           = (known after apply)
      + project          = "infrateam-playground"
      + region           = "asia-southeast1"
      + schedule         = "0 15 * * *"
      + state            = (known after apply)
      + time_zone        = "Asia/Singapore"

      + http_target {
          + http_method = "GET"
          + uri         = "https://duc-bac-nginx-service-1046428081626.asia-southeast1.run.app"
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.networks.google_compute_address.duc_bac_nat_ip will be created
  + resource "google_compute_address" "duc_bac_nat_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "duc-bac-nat-ip"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "infrateam-playground"
      + purpose            = (known after apply)
      + region             = "asia-southeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

  # module.networks.google_compute_network.duc_bac_cloudrun_network will be created
  + resource "google_compute_network" "duc_bac_cloudrun_network" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "duc-bac-cloudrun-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "infrateam-playground"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.networks.google_compute_router.duc_bac_router will be created
  + resource "google_compute_router" "duc_bac_router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "duc-bac-router"
      + network            = (known after apply)
      + project            = "infrateam-playground"
      + region             = "asia-southeast1"
      + self_link          = (known after apply)
    }

  # module.networks.google_compute_router_nat.duc_bac_nat_gateway will be created
  + resource "google_compute_router_nat" "duc_bac_nat_gateway" {
      + auto_network_tier                   = (known after apply)
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + endpoint_types                      = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "duc-bac-nat-gateway"
      + nat_ip_allocate_option              = "MANUAL_ONLY"
      + nat_ips                             = (known after apply)
      + project                             = "infrateam-playground"
      + region                              = "asia-southeast1"
      + router                              = "duc-bac-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30
    }

  # module.networks.google_compute_subnetwork.duc_bac_subnetwork will be created
  + resource "google_compute_subnetwork" "duc_bac_subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "duc-bac-subnetwork"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "infrateam-playground"
      + purpose                    = (known after apply)
      + region                     = "asia-southeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.networks.google_vpc_access_connector.duc_bac_serverless_vpc_connector will be created
  + resource "google_vpc_access_connector" "duc_bac_serverless_vpc_connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.15.0.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = (known after apply)
      + max_throughput     = 300
      + min_instances      = (known after apply)
      + min_throughput     = 200
      + name               = "duc-bac-vpc-connector"
      + network            = "duc-bac-cloudrun-network"
      + project            = "infrateam-playground"
      + region             = "asia-southeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_run_url = "https://duc-bac-nginx-service-alexaun4ga-as.a.run.app" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @bacducdinh, Action: `pull_request`*